
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Свойство("НомерНаправления")) Тогда
		
		ОбщееНаправление = Параметры.ОбщееНаправление;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	_ИМЦ_РезультатыИсследований.ДополнительныеСведения,
		               |	_ИМЦ_РезультатыИсследований.Показатель,
		               |	_ИМЦ_РезультатыИсследований.Условие,
		               |	_ИМЦ_РезультатыИсследований.РезультатСтрока
		               |ИЗ
		               |	РегистрСведений._ИМЦ_РезультатыИсследований КАК _ИМЦ_РезультатыИсследований
		               |ГДЕ
		               |	_ИМЦ_РезультатыИсследований.ОбщееНаправление = &ОбщееНаправление
		               |	И _ИМЦ_РезультатыИсследований.НомерНаправления = &НомерНаправления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	_ИМЦ_РезультатыИсследований.НомерВЖурналеТЧ";
		
		Запрос.УстановитьПараметр("ОбщееНаправление", ОбщееНаправление);
		Запрос.УстановитьПараметр("НомерНаправления", Параметры.НомерНаправления);   		 
		
		Результат =  Запрос.Выполнить().Выгрузить();
		//ЗначениеВДанныеФормы(Результат, "ТЗ"); 
		
		Для каждого Стр Из Результат Цикл
			
			КодПробы         = Параметры.КодПробы;
			НомерНаправления = Параметры.НомерНаправления;
			НСТР = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НСТР,Стр);
			
		КонецЦикла;
		
	Иначе	
		
		Отказ = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПротокол(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КодПробы", КодПробы); 		
	ПараметрыФормы.Вставить("НомерНаправления", НомерНаправления); 
	ПараметрыФормы.Вставить("ОбщееНаправление", ОбщееНаправление); 
	
	ОткрытьФорму("Документ._ИМЦ_ЕдиныйПротокол.Форма.ФормаДокумента",ПараметрыФормы,); 
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
