//======================================================================================================================

#Область ОбРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда		
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;  		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		
		ТабДок = Новый ТабличныйДокумент;
		ПечатьМедКнижкиНаСервере(ТабДок);
		//ТабДок.Показать();
		ИмяСпецПринтера = ИмяСпецПринтера();
		Если ЗначениеЗаполнено(ИмяСпецПринтера) Тогда
			ТабДок.ИмяПринтера = ИмяСпецПринтера;
		КонецЕсли;
		ТабДок.Напечатать();
		Отказ = Истина;
		
	КонецЕсли;
	
	
КонецПроцедуры  

#КонецОбласти

//======================================================================================================================

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

#КонецОбласти

//======================================================================================================================

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура ПечатьМедКнижки(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьМедКнижкиНаСервере(ТабДок);
	ТабДок.Показать();
	
	//ИмяСпецПринтера = ИмяСпецПринтера();
	//Если ЗначениеЗаполнено(ИмяСпецПринтера) Тогда
	//	ТабДок.ИмяПринтера = ИмяСпецПринтера;
	//КонецЕсли;
	//ТабДок.Напечатать();
КонецПроцедуры

#КонецОбласти

//======================================================================================================================

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПечатьМедКнижкиНаСервере(ТабДок)
	
	мОбъект				= РеквизитФормыВЗначение("Объект");
	Макет				= мОбъект.ПолучитьМакет("Макет");
	
	ОбластьПараметров	= Макет.ПолучитьОбласть(ОбластьПараметров);
	ОбластьПараметров.Параметры.Фамилия		= СсылкаНаОбъект.Фамилия;
	ОбластьПараметров.Параметры.ИмяОтчество	= СсылкаНаОбъект.Имя + " " + СсылкаНаОбъект.Отчество;
	ОбластьПараметров.Параметры.ГодРождения	= ?(ЗначениеЗаполнено(СсылкаНаОбъект.ДатаРождения), Формат(СсылкаНаОбъект.ДатаРождения, "ДФ=dd.MM.yyyy"), "");
	МасСтрокАдресов = РазбитьТекстНаМассивСтрок(СсылкаНаОбъект.Адрес, "Адрес");
	
	Если МасСтрокАдресов.Количество() Тогда
		
		ОбластьПараметров.Параметры.Адрес1Строка	= МасСтрокАдресов[0];
		Если МасСтрокАдресов.Количество() > 1 Тогда
			Адрес2Строка = "";
			Для й = 1 По МасСтрокАдресов.Количество()-1 Цикл
				Адрес2Строка = Адрес2Строка + " " + МасСтрокАдресов[й];
			КонецЦикла;
			Адрес2Строка = СокрЛП(Адрес2Строка);
			
			ОбластьПараметров.Параметры.Адрес = Адрес2Строка;
			
		КонецЕсли;
		
	КонецЕсли;

	
	//ОбластьПараметров.Параметры.Адрес		= СсылкаНаОбъект.Адрес;
	ОбластьПараметров.Параметры.Должность	= СсылкаНаОбъект.Должность;
	МасСтрокОрган = РазбитьТекстНаМассивСтрок(СсылкаНаОбъект.МестоРаботы, "Организация");
	
	Если МасСтрокОрган.Количество() Тогда
		
		ОбластьПараметров.Параметры.Организация1Строка	= МасСтрокОрган[0];
		Если МасСтрокОрган.Количество() > 1 Тогда
			Организация2Строка = "";
			Для й = 1 По МасСтрокОрган.Количество()-1 Цикл
				Организация2Строка = Организация2Строка + " " + МасСтрокОрган[й];
			КонецЦикла;
			
			ОбластьПараметров.Параметры.Организация = Организация2Строка;
			Организация2Строка = СокрЛП(Организация2Строка);
		КонецЕсли;

	КонецЕсли;
	
	ТабДок.Вывести(ОбластьПараметров);	
	
КонецПроцедуры

&НаСервере
Функция ИмяСпецПринтера()
	
	УстановитьПривилегированныйРежим(Истина);

	РабМесто = ПараметрыСеанса._ИМЦ_РабочееМесто;
	Если ЗначениеЗаполнено(РабМесто.ИмяСпецПринтера) Тогда
		Возврат РабМесто.ИмяСпецПринтера;
	Иначе
		Возврат "";
	КонецЕсли;  
	
	УстановитьПривилегированныйРежим(Ложь);

КонецФункции

&НаСервере
Функция РазбиениеСтрокиНаСлова(Строка, Разделитель = " ", Сокращать = Ложь)
	
	РезультатФункции = Новый Массив;
	
	СтрокаПоиска = Строка;
	Позиция = Найти(СтрокаПоиска, Разделитель);
	Пока Позиция <> 0 Цикл
		ПодСтрока = Лев(СтрокаПоиска, Позиция);
		
		ПозицияПереводСтроки = Найти(ПодСтрока, Символы.ПС);
		Если ПозицияПереводСтроки <> 0 Тогда
			
			Если ПозицияПереводСтроки <> 1 Тогда
				ДоСимволаПС = Лев(ПодСтрока,ПозицияПереводСтроки-1);
				РезультатФункции.Добавить(ДоСимволаПС);
							
				ПослеСимволаПС = Сред(ПодСтрока,ПозицияПереводСтроки);
				РезультатФункции.Добавить(ПослеСимволаПС);
								
			Иначе
				РезультатФункции.Добавить(ПодСтрока);
			КонецЕсли;
			
		Иначе
			РезультатФункции.Добавить(?(Сокращать, СокрЛП(ПодСтрока), ПодСтрока));

		КонецЕсли; 		
		
		СтрокаПоиска = Сред(СтрокаПоиска, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(СтрокаПоиска, Разделитель);
		
		
	КонецЦикла;
	Если СтрДлина(СтрокаПоиска) > 0 Тогда
		РезультатФункции.Добавить(?(Сокращать, СокрЛП(СтрокаПоиска), СтрокаПоиска));
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция РазбитьТекстНаМассивСтрок(Текст, ИмяПараметра)
	
	ДанныйОбъект		= РеквизитФормыВЗначение("Объект");	
	МакетОбработки		= ДанныйОбъект.ПолучитьМакет("МакетДляДеленияСтрок");
	ОбластьПустаяОбласть= МакетОбработки.ПолучитьОбласть("ПустаяОбласть");
	ОбластьПустаяСтрока	= МакетОбработки.ПолучитьОбласть("ПустаяСтрока");
	ОбластьТекст		= МакетОбработки.ПолучитьОбласть(ИмяПараметра);
	
	
	ВремТабДок = Новый ТабличныйДокумент;
	//ВремТабДок.Вывести(ОбластьПустаяСтрока);
	
	МассивСлов = Новый Массив;
	МассивСлов = РазбиениеСтрокиНаСлова(Текст);
	щщ = 0; 
	
	МассивСтрок = Новый Массив;
	СтрокаСДобавлением				= "";
	СтрокаБезПоследненгоДобавления	= "";
	
	ВремТабДок.Вывести(ОбластьПустаяОбласть); 
	
	Для щщ = 0 по МассивСлов.Количество()-1 Цикл 	          	
		
		СтрокаСДобавлением = СтрокаСДобавлением + Строка(МассивСлов[щщ]);
		ОбластьТекст.Параметры.Текст = СтрокаСДобавлением;
		
		Если ВремТабДок.ПроверитьВывод(ОбластьТекст) Тогда
			СтрокаБезПоследненгоДобавления = СтрокаСДобавлением;
		Иначе
			ОбластьТекст.Параметры.Текст = СтрокаБезПоследненгоДобавления;
			ВремТабДок.Вывести(ОбластьТекст);
			
			МассивСтрок.Добавить(СтрокаБезПоследненгоДобавления);
			щщ = щщ - 1;
			СтрокаБезПоследненгоДобавления	= "";
			СтрокаСДобавлением				= "";
			ВремТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ВремТабДок.Вывести(ОбластьПустаяОбласть);
			       			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСтрок.Добавить(СтрокаСДобавлением);
	ОбластьТекст.Параметры.Текст = СтрокаСДобавлением;
	ВремТабДок.Вывести(ОбластьТекст);
	Возврат МассивСтрок;
	//Возврат ВремТабДок;
	
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	
	ВремТабДок = РазбитьТекстНаМассивСтрок("443004, Самарская обл, Самара г, Молодежный пер, дом № 5, корпус 24", "Адрес");
	ВремТабДок.Показать();
	
КонецПроцедуры





#КонецОбласти

//======================================================================================================================



