&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда		
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;  	
		
		Если Параметры.Свойство("СсылкаНаВнешОбр") Тогда
			НаборЗаписей = РегистрыСведений._ИМЦ_Исследование_ПечатнаяФорма.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(СсылкаНаОбъект);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			Запись = НаборЗаписей.Добавить();			
			Запись.Документ			= СсылкаНаОбъект;; 
			Запись.ВнешняяОбработка	= Параметры.СсылкаНаВнешОбр;			
			НаборЗаписей.Записать(); 
		КонецЕсли;


	КонецЕсли
	
КонецПроцедуры
	 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Отказ = Истина;
		ТабДок = ПечатьТабДок(СсылкаНаОбъект);
		_ИМЦ_МодульФайлыПечатьКлиент.СозданиеФайлаПриПечатиИзВнешнихОбработок(ТабДок,ССылкаНаОбъект,ПрефиксНаименованияФайла,ЭтаФорма);
				
	КонецЕсли;  	
	
КонецПроцедуры

&НаСервере
Функция ПечатьТабДок(СсылкаНаОбъект)
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныйОбъект = РеквизитФормыВЗначение("Объект");
	ОтветСТруктура = ДанныйОбъект.ФормированиеМасОбластей(СсылкаНаОбъект, "Исследование");
	
	КолвоТаб = ОтветСТруктура.Количество();

	Для щщ = 1 По КолвоТаб Цикл
		ТабДок.Вывести(ОтветСТруктура["табдок" + щщ]);
	КонецЦикла;

	#Область Нижний_колонтитул
	
	ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДок.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабДок.РазмерКолонтитулаСнизу = 20;
   
    ТабДок.НижнийКолонтитул.ТекстСправа = "Страница___из___" ;                            
	
	Если  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Сызран") Тогда  	
		ИЛЦ = "ИЛЦ филиала ФБУЗ  «Центр гигиены и эпидемиологии в Самарской области в городе Сызрани».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Чапаевск") Тогда 
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Чапаевск».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Сергиевск") Тогда 		
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в Сергиевском районе».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Тольятти") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Тольятти».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Нефтегорск") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в Нефтегорском районе».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Отрадном") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Отрадном».";
		
	ИначеЕсли  Найти(СсылкаНаОбъект._ИМЦ_Организация,"Новокуйбышевск") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Новокуйбышевске».";
		
	Иначе	
		ИЛЦ = "ИЛЦ ФБУЗ «Центр гигиены и эпидемиологии в Самарской области».";
	КонецЕсли;  	
	
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "                                                                                                                                        
	|Настоящие результаты лабораторных испытаний  распространяются только на образец, подвергнутый испытаниям. 
	|Результаты лабораторных испытаний не могут быть воспроизведены полностью или частично без письменного 
	|разрешения " + ИЛЦ;     	
	//ТабДок.НижнийКолонтитул.Шрифт.Имя
	ТабДок.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman",10,,Истина);
	ТабДок.ПолеСнизу = 30;			
	ТабДок.НижнийКолонтитул.Выводить = Истина; 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.НижнийКолонтитул.Шрифт.Размер = 4;
	
	#КонецОбласти
	
	Если СтрДлина(СсылкаНаОбъект.ПродуктыПоказатели[0].ДополнительныеСведения) > 50  Тогда
		ПрефиксНаименованияФайла = "Исследование_РегНомер_" + СсылкаНаОбъект.НомерВЖурнале + "_Код_" + СсылкаНаОбъект.КодКонтрагента + "_" + Сред(СсылкаНаОбъект.ПродуктыПоказатели[0].ДополнительныеСведения,1,50); 
	Иначе 		
		ПрефиксНаименованияФайла = "Исследование_РегНомер_" + СсылкаНаОбъект.НомерВЖурнале + "_Код_" + СсылкаНаОбъект.КодКонтрагента + "_" + СсылкаНаОбъект.ПродуктыПоказатели[0].ДополнительныеСведения; 
	КонецЕсли;
	ПрефиксНаименованияФайла = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПрефиксНаименованияФайла,"""", ""),"/", ""),"\", "");
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ОпределениеФорматаЗначенияПоказателя(Показатель,Примечание);

	Отбор = новый Структура("Методика",Примечание);
	Найд = Показатель.ТЧМетодики.НайтиСтроки(Отбор); 		
	
	Если Найд.Количество() <> 0 Тогда
		Если Найд[0].КоличествоЗначащихЗнаков <> 0 Тогда 
			Возврат Найд[0].КоличествоЗначащихЗнаков;
		Иначе	
			 Возврат Неопределено;
		КонецЕсли;
	Иначе	
		 Возврат Неопределено;
	КонецЕсли;	
		
	
КонецФункции

&НаКлиенте
Процедура СформироватьТабличныйДокумент(Команда)
	ТабДок = ПечатьТабДок(СсылкаНаОбъект);
	ТабДок.Показать(); 
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ТабДок = ПечатьТабДок(ССылкаНаОбъект);
	ТабДок.Показать();
	
КонецПроцедуры

