
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Организация 	= ПараметрыСеанса.ТекущийПользователь._ИМЦ_Организация;
	Подразделение 	= ПараметрыСеанса.ТекущийПользователь.Подразделение;
	
	Если РольДоступна("ПолныеПрава") Тогда
		
		Элементы.Организация.Доступность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	ТабДок = СформироватьНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()

	
	РАд		= Справочники._ИМЦ_ТипыЛабораторий.НайтиПоНаименованию("Радиологическая лаборатория");
	СГЛ		= Справочники._ИМЦ_ТипыЛабораторий.НайтиПоНаименованию("Санитарно-гигиеническая лаборатория");
	Микро	= Справочники._ИМЦ_ТипыЛабораторий.НайтиПоНаименованию("Микробиологическая лаборатория");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.КодПробы КАК КодПробы,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Лаборатория,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ПродуктИсследования,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДополнительныеСведения,
	               |	СУММА(_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Количество) КАК Количество,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НомерНаправления,
	               |	ВЫРАЗИТЬ(_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НаименованиеДляПротокола КАК СТРОКА(200)) КАК НаименованиеДляПротокола,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Контрагент,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Ответственный,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ДатаИВремяПоступления,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ДатаОтбораПроб,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДатаОтбора,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ГУИД,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ВидУпаковки
	               |ПОМЕСТИТЬ ВТ1
	               |ИЗ
	               |	Документ._ИМЦ_ОбщееНаправление.ИсследованияПоЛабораториям КАК _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям
	               |ГДЕ
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка._ИМЦ_Организация = &Организация
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаН, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаК, ДЕНЬ)
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Подразделение В ИЕРАРХИИ(&Подразделение)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Лаборатория,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ПродуктИсследования,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДополнительныеСведения,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.КодПробы,
	               |	ВЫРАЗИТЬ(_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НаименованиеДляПротокола КАК СТРОКА(200)),
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НомерНаправления,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Ответственный,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ДатаИВремяПоступления,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ДатаОтбораПроб,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДатаОтбора,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Контрагент,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ГУИД,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ВидУпаковки
	               |{УПОРЯДОЧИТЬ ПО
	               |	НомерНаправления}
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ1.КодПробы,
	               |	ВТ1.Лаборатория,
	               |	ВТ1.ПродуктИсследования,
	               |	ВТ1.ДополнительныеСведения,
	               |	ВТ1.Количество,
	               |	ВТ1.НомерНаправления,
	               |	ВТ1.НаименованиеДляПротокола,
	               |	ВТ1.Контрагент,
	               |	ВТ1.Ответственный,
	               |	ВТ1.ДатаИВремяПоступления,
	               |	ВТ1.ДатаОтбораПроб,
	               |	ВТ1.ДатаОтбора,
	               |	ВТ1.ГУИД,
	               |	ВТ1.ВидУпаковки,
	               |	_ИМЦ_Связь_Протокол_КодПробы_НомерНаправления.Регистратор КАК Протокол
	               |ИЗ
	               |	ВТ1 КАК ВТ1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ИМЦ_Связь_Протокол_КодПробы_НомерНаправления КАК _ИМЦ_Связь_Протокол_КодПробы_НомерНаправления
	               |		ПО ВТ1.КодПробы = _ИМЦ_Связь_Протокол_КодПробы_НомерНаправления.КодПробы";
	
	Запрос.УстановитьПараметр("ДатаН", ДатаН);
	Запрос.УстановитьПараметр("ДатаК", ДатаК);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
	КонецЕсли;
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТЗ_ГУИД_КодПробы = Результат.Скопировать();
	ТЗ_ГУИД_КодПробы.Свернуть("ГУИД, КодПробы");
	
	ТЗ_КодПробы = Результат.Скопировать();
	ТЗ_КодПробы.Свернуть("КодПробы");
	
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныйОбъект = РеквизитФормыВЗначение("Объект");
	МакетОбработки = ДанныйОбъект.ПолучитьМакет("Макет");
	ОбластьШапка   = МакетОбработки.ПолучитьОбласть("Шапка");
	ОбластьТаблица = МакетОбработки.ПолучитьОбласть("Таблица");

	ТабДок.Вывести(ОбластьШапка);
	
	счетчик = 1;
	
	Для каждого СТрКод Из ТЗ_КодПробы Цикл
		
		Если ЗначениеЗаполнено(СТрКод.КодПробы) Тогда
			
			НайденныеСтрокиГУИД = ТЗ_ГУИД_КодПробы.НайтиСтроки(Новый Структура("КодПробы", СтрКод.КодПробы));
			Если НайденныеСтрокиГУИД.Количество() Тогда
				
				НайденныеСтроки = Результат.НайтиСтроки(Новый Структура("ГУИД", НайденныеСтрокиГУИД[0].ГУИД));
				
				Если НайденныеСтрокиГУИД.Количество() = 1  Тогда
					ОбластьТаблица.Параметры.ОбъектИсследования = НайденныеСтроки[0].НаименованиеДляПротокола;
					ОбластьТаблица.Параметры.КолвоОбразцов 		= "";
				Иначе
					ОбластьТаблица.Параметры.ОбъектИсследования = НайденныеСтроки[0].ПродуктИсследования;	//СМЫВЫ	
					ОбластьТаблица.Параметры.КолвоОбразцов 		= НайденныеСтрокиГУИД.Количество();
				КонецЕсли;      				
				
				ОбластьТаблица.Параметры.ПорядНомер = счетчик;
				
				ОбластьТаблица.Параметры.ДатаПоступления 	= НайденныеСтроки[0].ДатаИВремяПоступления;
				ОбластьТаблица.Параметры.Заявитель 			= НайденныеСтроки[0].Контрагент;
				ОбластьТаблица.Параметры.Упаковка 			= НайденныеСтроки[0].ВидУпаковки;
				ОбластьТаблица.Параметры.КодОбразца 		= НайденныеСтроки[0].КодПробы;
				
				Если НайденныеСтроки[0].Лаборатория.ТипЛаборатории = Рад Тогда
					ОбластьТаблица.Параметры.Рад = "+";
				ИначеЕсли НайденныеСтроки[0].Лаборатория.ТипЛаборатории = СГЛ Тогда
					ОбластьТаблица.Параметры.СГЛ = "+";
				ИначеЕсли НайденныеСтроки[0].Лаборатория.ТипЛаборатории = Микро Тогда
					ОбластьТаблица.Параметры.Микро = "+";
				КонецЕсли;
				
				
				////////////////////ОбластьТаблица.Параметры.ДатаОкончанияИсследования  = Стр.;
				//ОбластьТаблица.Параметры.КолвоКонтрОбразов 			= ;
				//ОбластьТаблица.Параметры.СрокХранения 				= ;
				Если ЗначениеЗаполнено(НайденныеСтроки[0].Протокол) Тогда
					ОбластьТаблица.Параметры.ПротоколИспытаний 	= Строка(НайденныеСтроки[0].Протокол.Номер) + " от " + Формат(НайденныеСтроки[0].Протокол.Дата, "ДФ=dd.MM.yyyy");
				Иначе
					ОбластьТаблица.Параметры.ПротоколИспытаний 	= "";
				КонецЕсли;
				
				ОбластьТаблица.Параметры.ОтобравшийПробу 	= НайденныеСтроки[0].Ответственный.Сотрудник;
				счетчик = счетчик +1;
				ТабДок.Вывести(ОбластьТаблица);
				
			КонецЕсли; 
			
		КонецЕсли;	
	
	КонецЦикла;
	
	
	//Для каждого Стр Из Результат Цикл
	//
	//	Если ЗначениеЗаполнено(Стр.КодПробы)  Тогда
	//		
	//	    Найденное = Результат.НайтиСтроки(Новый структура("КодПробы", Стр.КодПробы));
	//		
	//	
	//	КонецЕсли;	 
	//
	//КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

