&НаСервере
Функция ФормированиеТабличногоДокумента_Протокола(СсылкаНаОбъект, ТабДок)  Экспорт
    	
	ВозрСтрукт = Новый Структура;
	сч = 0;
	 			
	#Область Получение_областей
	      	
    МакетОбработки = ПолучитьМакет("МакетПротокола");	
	
	ОбластьПустаяСтрока		= МакетОбработки.ПолучитьОбласть("ПустаяСтрока");    	
	ОбластьТабЛаборатория	= МакетОбработки.ПолучитьОбласть("ТабЛаборатория");
	ОбластьТаблицаШапка		= МакетОбработки.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТаблицаШапка2	= МакетОбработки.ПолучитьОбласть("ТаблицаШапка2");
	ОбластьТаблица			= МакетОбработки.ПолучитьОбласть("Таблица");
	ОбластьТаблица2			= МакетОбработки.ПолучитьОбласть("Таблица2");
	
	#КонецОбласти
	
	ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьПустаяСтрока);
		
	#Область тз
	
	Первая = Истина;
	Для каждого Стр из СсылкаНаОбъект.ПродуктыПоказатели Цикл
		Если Найти(Строка(Стр.ЖурналИсследований),"антибиотик") = 0 Тогда
			
			Если Первая Тогда //выводим шапку таблицы
				
				ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблицаШапка);    					
				ОбластьТабЛаборатория.Параметры.Лаборатория 			 = СсылкаНаОбъект.Лаборатория;
				ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = Стр.НомерВЖурнале;
				ДобавлениеОбластиВструктуру(сч, ВозрСтрукт,ОбластьТабЛаборатория);
				Первая = Ложь;
				
			КонецЕсли;	
			ОбластьТаблица.Параметры.Показатель = Стр.Показатель;
			ОбластьТаблица.Параметры.ЕдИзмер    = Стр.Показатель.ЕдиницаИзмерения;
			ОбластьТаблица.Параметры.Результат 	= ДобавитьСимволСтепень(Стр.РезультатСтрока); 
			//ОбластьТаблица.Параметры.Норма 		= ДобавитьСимволСтепень(Стр.Объем); 
			ОбластьТаблица.Параметры.НД 		= Стр.Примечание; 
			
			ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблица);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Первая = Истина;
	Для каждого Стр из СсылкаНаОбъект.ПродуктыПоказатели Цикл
		Если Найти(Строка(Стр.ЖурналИсследований),"антибиотик") <> 0 Тогда
			Если Первая Тогда //выводим шапку таблицы
				
				ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблицаШапка2);    					
				ОбластьТабЛаборатория.Параметры.Лаборатория 			 = СсылкаНаОбъект.Лаборатория;
				ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = Стр.НомерВЖурнале;
				ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТабЛаборатория);
				Первая = Ложь;
				
			КонецЕсли;	
			ОбластьТаблица2.Параметры.Показатель 	= Стр.Показатель;
			ОбластьТаблица2.Параметры.Результат 	= Стр.РезультатСтрока + Стр.Показатель.ЕдиницаИзмерения; 
			//ОбластьТаблица2.Параметры.Норма 		= "Не допускается"; 
			ОбластьТаблица2.Параметры.Примечание	= Стр.Объем; 
			ОбластьТаблица2.Параметры.НД 			= Стр.Примечание; 
			
			ДобавлениеОбластиВструктуру(сч, ВозрСтрукт,ОбластьТаблица2);
		КонецЕсли;	
		
	КонецЦикла;		

	#КонецОбласти 
	
		
	Возврат ВозрСтрукт;
	

	
КонецФункции

&НаСервере
Функция ФормированиеТабличногоДокумента_Экспертного(СсылкаНаОбъект, ТабДок)  Экспорт
	        	
	#Область Получение_областей
	      	
    МакетОбработки = ПолучитьМакет("МакетЭкспертного");	
	
	ОбластьПустаяСтрока		= МакетОбработки.ПолучитьОбласть("ПустаяСтрока");    	
	ОбластьШапка			= МакетОбработки.ПолучитьОбласть("ТаблицаШапка");
	ОбластьШапка2			= МакетОбработки.ПолучитьОбласть("ТаблицаШапка2");
	ОбластьТабЛаборатория	= МакетОбработки.ПолучитьОбласть("ТабЛаборатория");
	ОбластьТаблица			= МакетОбработки.ПолучитьОбласть("Таблица");
	ОбластьТаблица2			= МакетОбработки.ПолучитьОбласть("Таблица2");
	
	#КонецОбласти
	
	ВозрСтрукт = Новый Структура;
	
	сч = 0;
	
	ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьПустаяСтрока);

	#Область тз
	
	Отбор = Новый Структура("Печать", Истина); 
	Найденные = СсылкаНаОбъект.ПродуктыПоказатели.НайтиСтроки(Отбор); 
	
	
	//ОбластьШапка.Параметры.ДатаПосева = Формат(СсылкаНаОбъект.ДатаОтбораПроб,"ДЛФ= ДД");
	
	Показатели = СсылкаНаОбъект.ПродуктыПоказатели.Выгрузить();
	Показатели.Свернуть("ПродуктИсследования,ДополнительныеСведения");
	
	ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьШапка); 
	
	Первая = Истина;
	Для каждого Стр из Найденные Цикл
		Если Найти(Строка(Стр.ЖурналИсследований),"антибиотик") = 0 Тогда
			Если Первая Тогда //выводим шапку таблицы
					
				//ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьШапка);
				ОбластьТабЛаборатория.Параметры.Лаборатория 			 = СсылкаНаОбъект.Лаборатория;
				ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = Стр.НомерВЖурнале;
				ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТабЛаборатория);
				Первая = Ложь;
				
			КонецЕсли;	
			ОбластьТаблица.Параметры.Показатель = Стр.Показатель;
			ОбластьТаблица.Параметры.ЕдИзмер    = Стр.Показатель.ЕдиницаИзмерения;
			ОбластьТаблица.Параметры.Результат 	= ДобавитьСимволСтепень(Стр.РезультатСтрока); 
			ОбластьТаблица.Параметры.Норма 		= ДобавитьСимволСтепень(Стр.Объем); 
			//ОбластьТаблица.Параметры.НД 		= Стр.Примечание; 
			
			ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблица);

		КонецЕсли;	
		
	КонецЦикла;	
	
	Первая = Истина;
	Для каждого Стр из Найденные Цикл
		Если Найти(Строка(Стр.ЖурналИсследований),"антибиотик") <> 0 Тогда
			Если Первая Тогда //выводим шапку таблицы
							
					//сч=сч+1; 
					//ВозрСтрукт.Вставить("ТабДок" + сч, Новый ТабличныйДокумент);
					//ВозрСтрукт["ТабДок" + сч].РазмерКолонтитулаСнизу	= 10;
					//ВозрСтрукт["ТабДок" + сч].ПолеСнизу				= 15;
					//ВозрСтрукт["ТабДок" + сч].ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;  
					//ВозрСтрукт["ТабДок" + сч].Вывести(ОбластьШапка);
					//
					
					ОбластьТабЛаборатория.Параметры.Лаборатория 			 = СсылкаНаОбъект.Лаборатория;
					ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = Стр.НомерВЖурнале;
					
					ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТабЛаборатория);
					
					Первая = Ложь;
				КонецЕсли;	
				
			ОбластьТаблица2.Параметры.Показатель 	= Стр.Показатель;
			ОбластьТаблица2.Параметры.Результат 	= Стр.РезультатСтрока + Стр.Показатель.ЕдиницаИзмерения; 
			ОбластьТаблица2.Параметры.Норма 		= "Не допускается"; 
			ОбластьТаблица2.Параметры.Норма	= Стр.Объем; 
			//ОбластьТаблица2.Параметры.НД 			= Стр.Примечание; 
			
			//ТабДок.Вывести(ОбластьТаблица2);
			ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблица2);

		КонецЕсли;	
		
	КонецЦикла;		
	
	#КонецОбласти 
	
		
	
	Возврат ВозрСтрукт;
	
КонецФункции

&НаСервере
Процедура ДобавлениеОбластиВСТруктуру(сч, ВозрСтрукт, Область)
	
	сч=сч+1;
	ВозрСтрукт.Вставить("ТабДок" + сч, Новый ТабличныйДокумент);
	ВозрСтрукт["ТабДок" + сч].РазмерКолонтитулаСнизу	= 10;
	ВозрСтрукт["ТабДок" + сч].ПолеСнизу					= 15;
	ВозрСтрукт["ТабДок" + сч].ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;  
	ВозрСтрукт["ТабДок" + сч].Вывести(Область);

КонецПроцедуры


Функция ДобавитьСимволСтепень(Входящая)
	
	Первая = Найти(Входящая,"@");
	Если Первая > 0 Тогда
		
		Если Найти(Входящая,"@1@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@1@","¹");
		ИначеЕсли Найти(Входящая,"@2@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@2@",Символ(178));
		ИначеЕсли Найти(Входящая,"@3@") > 0 Тогда
			//Исходящая = СтрЗаменить(Входящая,"@3@",Символ(179));
			Исходящая = СтрЗаменить(Входящая,"@3@","³");
		ИначеЕсли Найти(Входящая,"@4@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@4@",Символ(8308));
		ИначеЕсли Найти(Входящая,"@5@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@5@",Символ(8309));
		ИначеЕсли Найти(Входящая,"@6@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@6@",Символ(8310));
		ИначеЕсли Найти(Входящая,"@7@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@7@",Символ(8311));
		ИначеЕсли Найти(Входящая,"@8@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@8@",Символ(8312));
		ИначеЕсли Найти(Входящая,"@9@") > 0 Тогда
			Исходящая = СтрЗаменить(Входящая,"@9@",Символ(8313));
		КонецЕсли;
		
		Если Найти(Входящая,"@") Тогда 
			Исходящая = ДобавитьСимволСтепень(Исходящая);
		КонецЕсли;	

	Иначе
		Исходящая = Входящая;
	КонецЕсли;	
	
	Возврат Исходящая;
	
КонецФункции	
