&НаСервере
Функция ФормированиеТабличногоДокумента_Протокола(СсылкаНаОбъект, ТабДок, ВыводитьШапкуТЗ = Истина)  Экспорт
	
		#Область Получение_областей
	      	
    МакетОбработки = ПолучитьМакет("МакетЭкспертного");	
	
	ОбластьПустаяСтрока		= МакетОбработки.ПолучитьОбласть("ПустаяСтрока");    	
	ОбластьШапка			= МакетОбработки.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТабЛаборатория	= МакетОбработки.ПолучитьОбласть("ТабЛаборатория");
	ОбластьТаблица			= МакетОбработки.ПолучитьОбласть("Таблица");
	
	#КонецОбласти
	               	
	ВозрСтрукт = Новый Структура;
	
	сч = 0;
	
	Если ВыводитьШапкуТЗ = Истина Тогда
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьПустаяСтрока);
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьШапка);
	КонецЕсли;
	                  	
	Если Найти(СсылкаНаОбъект.Лаборатория,"Санитарно-гигиеническая") Тогда 
		ОбластьТабЛаборатория.Параметры.Лаборатория = "КОЛИЧЕСТВЕННЫЙ ХИМИЧЕСКИЙ АНАЛИЗ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"бактериолог") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МИКРОБИОЛОГИЧЕСКИЕ ИСПЫТАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"Микробиологич") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МИКРОБИОЛОГИЧЕСКИЕ ИСПЫТАНИЯ";	
	ИначеЕсли  Найти(СсылкаНаОбъект.Лаборатория,"особо опасных") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "ИССЛЕДОВАНИЯ ОСОБО ОПАСНЫХ ИНФЕКЦИЙ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"ПЦР") Тогда   
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МОЛЕКУЛЯРНО-ГЕНЕТИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"радио") или Найти(СсылкаНаОбъект.Лаборатория,"радиа")  Тогда  
		ОбластьТабЛаборатория.Параметры.Лаборатория = "РАДИОЛОГИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"токс") Тогда  			
		ОбластьТабЛаборатория.Параметры.Лаборатория = "ТОКСИКОЛОГИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	Иначе
		ОбластьТабЛаборатория.Параметры.Лаборатория = ВРег(Строка(СсылкаНаОбъект.Лаборатория));   	
	КонецЕсли;   
	
	ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = СсылкаНаОбъект.НомерВЖурнале;
	
	ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТабЛаборатория);

	#Область тз
	
		
   	Показатели = СсылкаНаОбъект.ПродуктыПоказатели.Выгрузить();
	Показатели.Свернуть("ГУИД,Показатель,Услуга,Примечание,Объем,Результат,ПродуктИсследования,РезультатСтрока, ДополнительныеСведения, ЗначениеУсловия,Условие,РезультатУсловия,Погрешность");
	максКолворезультатов = 1;
	НомерСтрокиВТабличнойЧасти = 10;
	Для каждого Стр из Показатели Цикл
		
		ОбластьТаблица.Параметры.Показатель						= Стр.Показатель;		
		ОбластьТаблица.Параметры.РезультатИзмеренийПогрешность	= Стр.РезультатСтрока;//Стр.ЗначениеУсловия; //РезультатСтрока;
		//ОбластьТаблица.Параметры.ВеличинаДопустимогоУровня		= _ИМЦ_СобытияФормСервер.ДобавитьСимволСтепень(Стр.Объем);
		ОбластьТаблица.Параметры.ЕденицаИзмерения				= _ИМЦ_СобытияФормСервер.ДобавитьСимволСтепень(Стр.Показатель.ЕдиницаИзмерения);
		ОбластьТаблица.Параметры.НД								= Стр.Примечание; 
		        	
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблица);
		
	КонецЦикла;  
		

	#КонецОбласти 
	
	Возврат ВозрСтрукт;


	
КонецФункции

&НаСервере
Функция ФормированиеТабличногоДокумента_Экспертного(СсылкаНаОбъект, ТабДок, ВыводитьШапкуТЗ = Истина)  Экспорт
	
	#Область Получение_областей
	      	
    МакетОбработки = ПолучитьМакет("МакетЭкспертного");	
	
	ОбластьПустаяСтрока		= МакетОбработки.ПолучитьОбласть("ПустаяСтрока");    	
	ОбластьШапка			= МакетОбработки.ПолучитьОбласть("ТаблицаШапка");
	ОбластьТабЛаборатория	= МакетОбработки.ПолучитьОбласть("ТабЛаборатория");
	ОбластьТаблица			= МакетОбработки.ПолучитьОбласть("Таблица");
	
	#КонецОбласти
	               	
	ВозрСтрукт = Новый Структура;
	
	сч = 0;
	
	Если ВыводитьШапкуТЗ = Истина Тогда
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьПустаяСтрока);
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьШапка);
	КонецЕсли;
	                  	
	Если Найти(СсылкаНаОбъект.Лаборатория,"Санитарно-гигиеническая") Тогда 
		ОбластьТабЛаборатория.Параметры.Лаборатория = "КОЛИЧЕСТВЕННЫЙ ХИМИЧЕСКИЙ АНАЛИЗ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"бактериолог") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МИКРОБИОЛОГИЧЕСКИЕ ИСПЫТАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"Микробиологич") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МИКРОБИОЛОГИЧЕСКИЕ ИСПЫТАНИЯ";	
	ИначеЕсли  Найти(СсылкаНаОбъект.Лаборатория,"особо опасных") Тогда
		ОбластьТабЛаборатория.Параметры.Лаборатория = "ИССЛЕДОВАНИЯ ОСОБО ОПАСНЫХ ИНФЕКЦИЙ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"ПЦР") Тогда   
		ОбластьТабЛаборатория.Параметры.Лаборатория = "МОЛЕКУЛЯРНО-ГЕНЕТИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"радио") или Найти(СсылкаНаОбъект.Лаборатория,"радиа")  Тогда  
		ОбластьТабЛаборатория.Параметры.Лаборатория = "РАДИОЛОГИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	ИначеЕсли Найти(СсылкаНаОбъект.Лаборатория,"токс") Тогда  			
		ОбластьТабЛаборатория.Параметры.Лаборатория = "ТОКСИКОЛОГИЧЕСКИЕ ИССЛЕДОВАНИЯ";
	Иначе
		ОбластьТабЛаборатория.Параметры.Лаборатория = ВРег(Строка(СсылкаНаОбъект.Лаборатория));   	
	КонецЕсли;   
	
	ОбластьТабЛаборатория.Параметры.НомерВЖурналеЛаборатории = СсылкаНаОбъект.НомерВЖурнале;
	
	ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТабЛаборатория);

	#Область тз
	
		
   	Показатели = СсылкаНаОбъект.ПродуктыПоказатели.Выгрузить();
	Показатели.Свернуть("ГУИД,Показатель,Услуга,Примечание,Объем,Результат,ПродуктИсследования,РезультатСтрока, ДополнительныеСведения, ЗначениеУсловия,Условие,РезультатУсловия,Погрешность");
	максКолворезультатов = 1;
	НомерСтрокиВТабличнойЧасти = 10;
	Для каждого Стр из Показатели Цикл
		
		ОбластьТаблица.Параметры.Показатель						= Стр.Показатель;		
		ОбластьТаблица.Параметры.РезультатИзмеренийПогрешность	= Стр.РезультатСтрока; //РезультатСтрока;
		ОбластьТаблица.Параметры.ВеличинаДопустимогоУровня		= _ИМЦ_СобытияФормСервер.ДобавитьСимволСтепень(Стр.Объем);
		ОбластьТаблица.Параметры.ЕденицаИзмерения				= _ИМЦ_СобытияФормСервер.ДобавитьСимволСтепень(Стр.Показатель.ЕдиницаИзмерения);
		//ОбластьТаблица.Параметры.НД								= Стр.Примечание; 
		        	
		ДобавлениеОбластиВструктуру(сч, ВозрСтрукт, ОбластьТаблица);
		
	КонецЦикла;  
		

	#КонецОбласти 
	
	Возврат ВозрСтрукт;
	
КонецФункции

&НаСервере
Процедура ДобавлениеОбластиВСТруктуру(сч, ВозрСтрукт, Область)
	
	сч=сч+1;
	ВозрСтрукт.Вставить("ТабДок" + сч, Новый ТабличныйДокумент);
	ВозрСтрукт["ТабДок" + сч].РазмерКолонтитулаСнизу	= 10;
	ВозрСтрукт["ТабДок" + сч].ПолеСнизу					= 15;
	ВозрСтрукт["ТабДок" + сч].ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;  
	ВозрСтрукт["ТабДок" + сч].Вывести(Область);

КонецПроцедуры
