&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда		
		
		Объект.СсылкаНаОбъект = Параметры.СсылкаНаОбъект;  
		
		//запись в регистр _ИМЦ_Исследование_ПечатнаяФорма 
		
		НаборЗаписей = РегистрыСведений._ИМЦ_Исследование_ПечатнаяФорма.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Объект.СсылкаНаОбъект);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Запись = НаборЗаписей.Добавить(); 
		
		Запись.Документ            = Объект.СсылкаНаОбъект;; 
		Запись.ВнешняяОбработка    = Параметры.СсылкаНаВнешОбр; 
		
		НаборЗаписей.Записать(); 
		
		
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Если ЗначениеЗаполнено(Объект.СсылкаНаОбъект) Тогда
		Отказ = Истина;
		ТабДок = ПечатьТабДок();
		_ИМЦ_МодульФайлыПечатьКлиент.СозданиеФайлаПриПечатиИзВнешнихОбработок(ТабДок,Объект.ССылкаНаОбъект,ПрефиксНаименованияФайла,ЭтаФорма);
				
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = ПечатьТабДок();
	ТабДок.Показать();   	
	
		
КонецПроцедуры


&НаСервере
функция ПечатьТабДок()
	
	ТабДок = Новый ТабличныйДокумент;
	ДанныйОбъект 	= РеквизитФормыВЗначение("Объект");
	//ОтветСТруктура 	= ДанныйОбъект.ФормированиеМасОбластей(Объект.СсылкаНаОбъект, "Протокол");
	//ОтветСТруктура 	= ДанныйОбъект.ФормированиеМасОбластей(Объект.СсылкаНаОбъект, "Экспертное");
	ОтветСТруктура 	= ДанныйОбъект.ФормированиеМасОбластей(Объект.СсылкаНаОбъект, "Исследование");
	
	КолвоТаб = ОтветСТруктура.Количество();
	
	Для щщ = 1 По КолвоТаб Цикл
		ТабДок.Вывести(ОтветСТруктура["табдок" + щщ]);
	КонецЦикла;
	
	#Область Нижний_колонтитул
	
	ТабДок.НижнийКолонтитул.НачальнаяСтраница = 1;
	ТабДок.НижнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
	ТабДок.РазмерКолонтитулаСнизу = 20;
	
	ТабДок.НижнийКолонтитул.ТекстСправа = "Страница___из___" ;                            
	
	Если  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Сызран") Тогда  	
		ИЛЦ = "ИЛЦ филиала ФБУЗ  «Центр гигиены и эпидемиологии в Самарской области в городе Сызрани».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Чапаевск") Тогда 
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Чапаевск».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Сергиевск") Тогда 		
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в Сергиевском районе».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Тольятти") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Тольятти».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Нефтегорск") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в Нефтегорском районе».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Отрадном") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Отрадном».";
		
	ИначеЕсли  Найти(Объект.СсылкаНаОбъект._ИМЦ_Организация,"Новокуйбышевск") Тогда
		ИЛЦ = "ИЛЦ Филиала ФБУЗ «Центр гигиены и эпидемиологии в Самарской области в городе Новокуйбышевске».";
		
	Иначе	
		ИЛЦ = "ИЛЦ ФБУЗ «Центр гигиены и эпидемиологии в Самарской области».";
	КонецЕсли;  	
	
	ТабДок.НижнийКолонтитул.ТекстВЦентре = "                                                                                                                                        
	|Настоящие результаты лабораторных испытаний  распространяются только на образец, подвергнутый испытаниям. 
	|Результаты лабораторных испытаний не могут быть воспроизведены полностью или частично без письменного 
	|разрешения " + ИЛЦ;     	
	//ТабДок.НижнийКолонтитул.Шрифт.Имя
	ТабДок.НижнийКолонтитул.Шрифт = Новый Шрифт("Times New Roman",10,,Истина);
	ТабДок.ПолеСнизу = 30;			
	ТабДок.НижнийКолонтитул.Выводить = Истина; 
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	//ТабДок.НижнийКолонтитул.Шрифт.Размер = 4;
	
	#КонецОбласти
	
	ПрефиксНаименованияФайла = "ИнфрЗ_" + СтрЗаменить(Объект.СсылкаНаОбъект.НомерВЖурнале,"/","") + Формат(Объект.СсылкаНаОбъект.Дата,"ДФ='""_от_""dd_MM_yy'");
	ПрефиксНаименованияФайла = СтрЗаменить(СтрЗаменить(СтрЗаменить(ПрефиксНаименованияФайла,"""", ""),"/", ""),"\", "");
	
	Возврат ТабДок;
	
КонецФункции

