иеЗаполнено(НачалоПериода) Тогда
		ТекстПредупреждения = "Не заполнено Период с;";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда
		ТекстПредупреждения = "Не заполнено Период по;";
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ТипФинансирования) Тогда
		ТекстПредупреждения = "Не заполнен Тип финансирования;";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		СформироватьНаСервере();
	Иначе
		ПоказатьПредупреждение(,ТекстПредупреждения,,"Внимание!" ); 
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.КодПробы КАК КодПробы,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДополнительныеСведения КАК ДополнительныеСведения,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Ответственный КАК Ответственный,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка._ИМЦ_Организация КАК _ИМЦ_Организация,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Дата КАК Дата
	               |ИЗ
	               |	Документ._ИМЦ_ОбщееНаправление.ИсследованияПоЛабораториям КАК _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям
	               |ГДЕ
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.КодПробы <> """"
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаН, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаК, ДЕНЬ)
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Подразделение = &Подразделение
	               |	И _ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.ТипФинансирования = &ТипФинансирования
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.КодПробы,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.ДополнительныеСведения,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Ответственный,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка._ИМЦ_Организация,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.Ссылка.Дата,
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НомерНаправления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	_ИМЦ_ОбщееНаправлениеИсследованияПоЛабораториям.НомерНаправления";
	
	Запрос.УстановитьПараметр("ДатаН", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаК", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ТипФинансирования", ТипФинансирования);
	
	Результат =  Запрос.Выполнить().Выгрузить();
	
	ТабДок.Очистить();
	Если Результат.Количество() Тогда
		
		мОбъект				= РеквизитФормыВЗначение("Объект");
		Макет				= мОбъект.ПолучитьМакет("Макет");
		
		ОбластьШапкаТЗ		= Макет.ПолучитьОбласть("ШапкаТЗ");
		ТабДок.Вывести(ОбластьШапкаТЗ);
		ОбластьСтрокаТЗ		= Макет.ПолучитьОбласть("СтрокаТЗ");
		
		Для Каждого Стр Из Результат Цикл
			
			ОбластьСтрокаТЗ.Параметры.Заполнить(Стр);
			ОбластьСтрокаТЗ.Параметры.Дата  = Формат(ОбластьСтрокаТЗ.Параметры.Дата , "ДФ=dd.MM.yyyy");			
			ТабДок.Вывести(ОбластьСтрокаТЗ);
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода	 = ТекущаяДата();
	ОкончаниеПериода = ТекущаяДата();
	Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.Подразделение.Видимость = Истина;
	Иначе
	  	Элементы.Подразделение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
