&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		
		СсылкаНаОбъект = Параметры.СсылкаНаОбъект;			    		
		ЗаполнениеРеквизитовФормы();  		
		
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если Не ЗначениеЗаполнено(ФИОРукЗаказчикаРодП) Или 		
		Не ЗначениеЗаполнено(ФИОРукЗаказчикаИмПад) Или
		Не ЗначениеЗаполнено(ИсполнительПодписывающий) Или
		Не ЗначениеЗаполнено(ФИОИсполнитель) Тогда
		
		Ответ = Вопрос("Заполнены не все данные! Продолжить?",РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да   Тогда
			
			мСтрукт = Новый Структура("ДолжностьЗаказчика,ОснованиеЗаказчика,ФИОРукЗаказчикаИмПад,ФИОРукЗаказчикаРодП,ИсполнительПодписывающий,ФИОИсполнитель,ФЗ223,ФЗ44,Контракт,ИндДоз",ДолжностьЗаказчика,ОснованиеЗаказчика,ФИОРукЗаказчикаИмПад,ФИОРукЗаказчикаРодП,ИсполнительПодписывающий,ФИОИсполнитель,ФЗ223,ФЗ44,Контракт, ИндДоз);
			ОповеститьОВыборе(мСтрукт);  
			
		КонецЕсли;
		
	Иначе	
		
		мСтрукт = Новый Структура("ДолжностьЗаказчика,ОснованиеЗаказчика,ФИОРукЗаказчикаИмПад,ФИОРукЗаказчикаРодП,ИсполнительПодписывающий,ФИОИсполнитель,ФЗ223,ФЗ44,Контракт,ИндДоз",ДолжностьЗаказчика,ОснованиеЗаказчика,ФИОРукЗаказчикаИмПад,ФИОРукЗаказчикаРодП,ИсполнительПодписывающий,ФИОИсполнитель,ФЗ223,ФЗ44,Контракт,ИндДоз);
		ОповеститьОВыборе(мСтрукт); 
		
	КонецЕсли;		
	
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
		
	мСтрукт = Новый Структура("ОтменаПечати",Истина);
	ОповеститьОВыборе(мСтрукт);  
	
КонецПроцедуры

&НаКлиенте
Процедура ФЗ223ПриИзменении(Элемент)
	
	Если  ФЗ223 = Истина   Тогда
		
		ФЗ44     = Ложь;
		Контракт = Истина;
		
	ИначеЕсли Фз44 = Ложь и ФЗ223 = Ложь Тогда
		
		Контракт = Ложь;
		
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура ФЗ44ПриИзменении(Элемент)
	
	Если  Фз44 = Истина   Тогда
		
		ФЗ223     = Ложь;
		Контракт  = Ложь;
		Элементы.Контракт.ТолькоПросмотр = Ложь;
	ИначеЕсли Фз44 = Ложь и ФЗ223 = Ложь Тогда
		
		Контракт = Ложь;		
		Элементы.Контракт.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере  
Процедура ЗаполнениеРеквизитовФормы()
	
	//Исполнитель
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	_ИМЦ_ПодписывающиеПодписываемыеДокументы.Влице,
	                      |	_ИМЦ_ПодписывающиеПодписываемыеДокументы.Подпись,
	                      |	_ИМЦ_ПодписывающиеПодписываемыеДокументы.Ссылка.Наименование КАК Представление
	                      |ИЗ
	                      |	Справочник._ИМЦ_Подписывающие.ПодписываемыеДокументы КАК _ИМЦ_ПодписывающиеПодписываемыеДокументы
	                      |ГДЕ
	                      |	_ИМЦ_ПодписывающиеПодписываемыеДокументы.Подразделение = &Подразделение
	                      |	И _ИМЦ_ПодписывающиеПодписываемыеДокументы.Документ ССЫЛКА Справочник._ИМЦ_Договора
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Представление");
	
	Запрос.УстановитьПараметр("Подразделение",СсылкаНаОбъект.ЛабораторияИнициатор);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Если  Выгрузка.Количество()   Тогда
		
		Элементы.ФИОИсполнитель.СписокВыбора.Очистить();
		Элементы.ИсполнительПодписывающий.СписокВыбора.Очистить();
		
		Для каждого Стр Из Выгрузка Цикл
			
			Элементы.ФИОИсполнитель.СписокВыбора.Добавить(Стр.Влице, Стр.Представление);  					
			Элементы.ИсполнительПодписывающий.СписокВыбора.Добавить(Стр.Подпись, Стр.Представление);
			
		КонецЦикла; 
		
	КонецЕсли;	 
	
	//Заявитель
	
	Если  Найти(СсылкаНаОбъект.ВидДоговора.Наименование,"с частными лицами") Тогда 
		ФИОРукЗаказчикаИмПад = СсылкаНаОбъект.Владелец.Наименование;
		
		Если ЗначениеЗаполнено(ФИОРукЗаказчикаИмПад) Тогда
			
			ИзменениеФамилииВродПадеж(ФИОРукЗаказчикаИмПад);
			
		КонецЕсли;
		
		Элементы.ДолжностьЗаказчика.Видимость = Ложь;
		Элементы.ОснованиеЗаказчика.Видимость = Ложь;
		
	Иначе	
		ФИОРукЗаказчикаИмПад = СсылкаНаОбъект.Владелец.Руководитель;	
		ОснованиеЗаказчика   = СсылкаНаОбъект.Владелец.Основание;
		ДолжностьЗаказчика   = СсылкаНаОбъект.Владелец.Должность;
		
		Если ЗначениеЗаполнено(ФИОРукЗаказчикаИмПад) Тогда
			
			ИзменениеФамилииВродПадеж(ФИОРукЗаказчикаИмПад);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОснованиеЗаказчика) Тогда
			
			Если ОснованиеЗаказчика = "Устав" Тогда 				
				ОснованиеЗаказчика = "Устава"  				
			Иначе  
				ОснованиеЗаказчика = _ИМЦ_МодульФайлыПечатьСервер.ПросклонятьБезИспользованияКомпоненты(ОснованиеЗаказчика,
				"Родительный", 
				Неопределено, 
				Неопределено, 
				Перечисления._ИМЦ_СклонятьКак.Профессия); 
				
			КонецЕсли;	

		КонецЕсли;  
	   			
	КонецЕсли; 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОРукЗаказчикаИмПадПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ФИОРукЗаказчикаИмПад) Тогда
		
		ИзменениеФамилииВродПадеж(ФИОРукЗаказчикаИмПад);   	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	мСтрукт = Новый Структура("ОтменаПечати",Истина);
	ОповеститьОВыборе(мСтрукт);  
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеФамилииВродПадеж(Знач ФИО)
	 	
	ФИО = СокрЛП(ФИОРукЗаказчикаИмПад);
	НайдТочка = Найти(ФИО,".");
	Если НайдТочка = 2 Тогда    ///инициалы находятся   перед фамилией
		
		Инициалы = Сред(ФИО,1,НайдТочка);
		ФИО = Сред(ФИО,НайдТочка+1);
		НайдТочка = Найти(ФИО,".");
		Инициалы = Инициалы + Сред(ФИО,1,НайдТочка);
		ФИО = Сред(ФИО,НайдТочка+1);

		//Инициалы = Сред(ФИО,1,4);
		Фамилия  = ФИО;
		ИзменяемаяСтрока = "";
		ИзменяемаяСтрока = Фамилия + " Брусок Деревович ";
		
		ИзменяемаяСтрока = _ИМЦ_МодульФайлыПечатьСервер.ПросклонятьБезИспользованияКомпоненты(ИзменяемаяСтрока, "Родительный", Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление._ИМЦ_СклонятьКак.ФИО"));
		ФИОРукЗаказчикаРодП = Инициалы + Сред(ИзменяемаяСтрока,1,Найти(ИзменяемаяСтрока, "Брус")-1);
		
	ИначеЕсли НайдТочка > 3 Тогда     ///инициалы находятся   после фамилией  
		
		Инициалы = Сред(ФИО,НайдТочка-1);
		Фамилия  = Сред(ФИО,1,НайдТочка-2);
		ИзменяемаяСтрока = "";
		ИзменяемаяСтрока = Фамилия + " Брусок Деревович ";
		
		ИзменяемаяСтрока = _ИМЦ_МодульФайлыПечатьСервер.ПросклонятьБезИспользованияКомпоненты(ИзменяемаяСтрока, "Родительный", Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление._ИМЦ_СклонятьКак.ФИО"));
		ФИОРукЗаказчикаРодП =  Сред(ИзменяемаяСтрока,1,Найти(ИзменяемаяСтрока, "Брус")-1) + Инициалы;
		
	Иначе
		
		ФИОРукЗаказчикаРодП = _ИМЦ_МодульФайлыПечатьСервер.ПросклонятьБезИспользованияКомпоненты(ФИОРукЗаказчикаИмПад, "Родительный", Неопределено, Неопределено, ПредопределенноеЗначение("Перечисление._ИМЦ_СклонятьКак.ФИО"));
		
		
	КонецЕсли; 
	
КонецПроцедуры	

